---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule
source: html/7fa26a3f-1640-4497-c60d-ac7af7624bb7.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule

This enum describes the different demand factor rule types available to the application.
 Within a demand factor a rule will be referenced and the user will have to enter values
 corresponding to that rule.

## Syntax (C#)
```csharp
public enum ElectricalDemandFactorRule
```